OdDAI.IEventCollector.logEvent(OdSmartPtr&lt;OdDAI.ErrorEvent&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Puts error event data to error event list.
\param eventToRecord [in] event to put.

OdDAI.IEventCollector.logEvent(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.UInt32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Put error data to error event list.
\param functionID [in] function name.
\param error [in] error id.
\param descpt [in] error description.

OdDAI.IEventCollector.onStopEventRecording
\details
Should be called when the event recording is end.

OdDAI.IEventCollector.onStartEventRecording
\details
Should be called when starting event recording.

OdDAI.IEventCollector.Dispose
\details
virtual destructor

OdDAI.IEventCollector
\details
Class should used as custom error event list flusher.